{
  "backend/main.mo": "Motoko backend actor handling inquiries with submit, list, confirm, delete operations and admin authorization checks.",
  "feature_evidence.json": "Feature evidence report describing a task to replace the site header logo asset while preserving the existing path.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference in build planning.",
  "frontend/index.css": "Tailwind CSS base styles and custom theme variables defining light and dark color systems and global typography.",
  "frontend/index.html": "Root HTML file setting metadata, favicon, Open Graph tags, and mounting the React app.",
  "frontend/src/App.tsx": "Main React router setup defining all application routes and layout with lazy-loaded gallery support.",
  "frontend/src/components/seo/Seo.tsx": "React component that dynamically updates page title and meta description/OG tags.",
  "frontend/src/components/site/FloatingContactActions.tsx": "Floating WhatsApp and phone call action buttons using business contact info.",
  "frontend/src/components/site/GalleryLightbox.tsx": "Modal lightbox for viewing gallery images with keyboard navigation and previous/next controls.",
  "frontend/src/components/site/InquiryForm.tsx": "A form component that collects inquiry details, submits them via a custom hook, and shows success or error alerts with an option to continue on WhatsApp.",
  "frontend/src/components/site/ServiceCard.tsx": "Displays a service’s icon, name, and description inside a styled card.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders the website footer with about text, social links, quick links, and contact info.",
  "frontend/src/components/site/SiteHeader.tsx": "Provides the site header with logo, navigation links, and a mobile menu using a sheet drawer.",
  "frontend/src/components/site/SiteLayout.tsx": "Wraps pages with a consistent layout including header, footer, and floating contact actions.",
  "frontend/src/components/site/SubmissionAlert.tsx": "Shows a styled success or error alert with appropriate icons and messaging.",
  "frontend/src/components/site/TestimonialCard.tsx": "Displays a testimonial with star rating, text, and author details.",
  "frontend/src/content/businessInfo.ts": "Exports core business contact details, WhatsApp info, and location map embed URL.",
  "frontend/src/content/galleryItems.ts": "Provides a list of gallery images and video placeholders with paths and alt text.",
  "frontend/src/content/services.ts": "Defines the list of services with names, descriptions, and associated icons.",
  "frontend/src/content/siteCopy.ts": "Contains structured copy for home, about, and coming-soon sections of the website.",
  "frontend/src/content/socialLinks.ts": "Exports social media profile links for Facebook, Instagram, and YouTube.",
  "frontend/src/content/testimonials.ts": "Provides an array of testimonial entries with names, events, text, and ratings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity, refetching dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and AuthClient initialization.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Defines a mutation to submit an inquiry through the actor and invalidates the inquiries query on success.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark theme CSS variables for the app.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO, story, mission, values, and expertise sections using site content.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information, an inquiry form, and related UI with SEO metadata.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery of images with a lightbox and includes SEO and a visual grid of gallery items.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero banner, intro content, service highlights, and CTA buttons using site copy and images.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a hero header and a grid of service cards plus a CTA for custom quotes using data from the services list.",
  "frontend/src/pages/SetupLaunchPage.tsx": "Shows a step‑by‑step setup and launch guide with cards explaining domain, hosting, HTTPS, and search configuration.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders a testimonials hero section and a grid of testimonial cards sourced from the testimonials data.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using URLSearchParams and sessionStorage.",
  "frontend/src/utils/whatsapp.ts": "Generates a WhatsApp message link by encoding inquiry data and using the configured business WhatsApp number.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, brand colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, requirements, architecture notes, and feature tracking for the website build."
}